Tools/src/Catalogs/ОИМЦ_63_МестаХранения/ОИМЦ_63_МестаХранения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ОИМЦ_63_МестаХранения</name>
  <owners>Catalog.ОИМЦ_63_Склады</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.ОИМЦ_63_Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.ОИМЦ_63_Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СтореИд</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлэсеИд</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Tools/src/Catalogs/ОИМЦ_63_Склады/ОИМЦ_63_Склады.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ОИМЦ_63_Склады</name>
  <owners>Catalog.ОИМЦ_63_Организации</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.ОИМЦ_63_Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СтореИд</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Tools/src/Catalogs/ОИМЦ_63_МестаХранения/Forms/ФормаСписка/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ЭтотОбъект.Список.Отбор.Элементы.Количество() = 0 Тогда
		Элементы.Заполнить.Видимость = Ложь;
		Элементы.ОтборОрганизация.Видимость = Истина;
	Иначе
		Элементы.Заполнить.Видимость = Истина;
		Элементы.ОтборОрганизация.Видимость = Ложь;
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	ТЗ = ОИМЦ_Данные.ЗапросДанных63("select distinct m.""placeID"", coalesce(d.description, 'Отделение') as descript, m.""storeID"" " + 
									"from ""movementDrug"".movement m left join documents.doc d on d.id = m.""placeID"" " +
									"where ""orgID"" = " + Формат(ЭтотОбъект.Список.Отбор.Элементы[0].ПравоеЗначение.Владелец.ОргИд, "ЧГ=0") + 
									" group by m.""placeID"", d.description, m.""storeID"" having m.""placeID"" > 0 order by descript;");
	Если ТЗ <> Неопределено Тогда
		УстановитьПривилегированныйРежим(Истина);
		Для каждого Элемент Из ТЗ Цикл
			Наименование = СокрЛП(Элемент.descript) + "_" + Формат(Элемент.placeID, "ЧГ=0");
			ПоискСклад = Справочники.ОИМЦ_63_Склады.НайтиПоРеквизиту("СтореИд", Формат(Элемент.storeID, "ЧГ=0"));
			Поиск = Справочники.ОИМЦ_63_МестаХранения.НайтиПоНаименованию(Наименование, Истина, , ПоискСклад.Ссылка);
			Если Поиск.Пустая() Тогда
				НО = Справочники.ОИМЦ_63_МестаХранения.СоздатьЭлемент();				
				НО.Наименование = Наименование;
				НО.Владелец = ПоискСклад.Ссылка;
				НО.Организация = ЭтотОбъект.Список.Отбор.Элементы[0].ПравоеЗначение.Владелец.Ссылка;				
				НО.Склад = ПоискСклад.Ссылка;
				НО.СтореИд = Элемент.storeID;
				НО.МестоХранения = Наименование;
				НО.ПлэсеИд = Элемент.placeID;			
				НО.Записать();	
			Иначе
				СО = Поиск.ПолучитьОбъект();
				СО.Склад = ПоискСклад.Ссылка;
				СО.СтореИд = Элемент.storeID;
				СО.МестоХранения = Наименование;
				СО.ПлэсеИд = Элемент.placeID;			
				СО.Записать();	
			КонецЕсли; 			
		КонецЦикла; 
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ОтборОрганизацияПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Организация", Организация,,, ЗначениеЗаполнено(Организация));
	Склад = ПредопределенноеЗначение("Справочник.ОИМЦ_63_Склады.ПустаяСсылка");
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Склад", Склад,,, ЗначениеЗаполнено(Склад));	
КонецПроцедуры

&НаКлиенте
Процедура ОтборОрганизацияОчистка(Элемент, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Организация) Тогда
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СкладОтборПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Склад", Склад,,, ЗначениеЗаполнено(Склад));	
КонецПроцедуры

&НаКлиенте
Процедура СкладОтборОчистка(Элемент, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Склад) Тогда
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
КонецПроцедуры
